src/DataProcessors/гф_ЗачетБонусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<DataProcessor>
		<Properties>
			<Name>гф_ЗачетБонусов</Name>
			<Comment>#wortmann #Бонусы Галфинд СадомцевСА 2023/03/14</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/AccumulationRegisters/гф_БонусыКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccumulationRegister>
		<Properties>
			<Name>гф_БонусыКлиентов</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КурсЕвро</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СПЗ</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СНПЗ</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидБонуса</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.гф_ВидыБонусов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/ДополнительныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеСведения</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/КорректировкаЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>КорректировкаЗадолженности</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Задолженность</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/гф_ЗачетБонусов/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере()
	ТаблицаБонусов.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИСТИНА КАК Отметка,
	               |	гф_БонусыКлиентовОстатки.Организация КАК Организация,
	               |	гф_БонусыКлиентовОстатки.Контрагент КАК Контрагент,
	               |	гф_БонусыКлиентовОстатки.Договор КАК Договор,
	               |	гф_БонусыКлиентовОстатки.ВидБонуса КАК ВидБонуса,
	               |	гф_БонусыКлиентовОстатки.СуммаОстаток КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.гф_БонусыКлиентов.Остатки(
	               |			&Период,
	               |			Организация = &Организация
	               |				И Контрагент = &Контрагент) КАК гф_БонусыКлиентовОстатки";
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "ИСТИНА");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Контрагент = &Контрагент", "ИСТИНА");
	КонецЕсли;
	Результат = Запрос.Выполнить();
	ТаблицаБонусов.Загрузить(Результат.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дата = ТекущаяДатаСеанса();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для Каждого Стр Из ТаблицаБонусов Цикл
		Стр.Отметка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для Каждого Стр Из ТаблицаБонусов Цикл
		Стр.Отметка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СоздатьКорректировкиЗадолженностейНаСервере()
	Для Каждого Стр Из ТаблицаБонусов Цикл
		Если Не Стр.Отметка Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.КорректирокаЗадолженности) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокОбъект = Документы.КорректировкаЗадолженности.СоздатьДокумент();
		ДокОбъект.Дата = Дата - 1;
		ДокОбъект.Организация = Стр.Организация;
		ДокОбъект.Контрагент = Стр.Контрагент;
		ДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности;
		ДокОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
		ДокОбъект.Комментарий = "#Создан обработкой Зачет бонусов";
		
		нс = ДокОбъект.Задолженность.Добавить();
		нс.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		нс.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
		нс.ВалютаВзаиморасчетов = Стр.Договор.ВалютаВзаиморасчетов;
		нс.Партнер = Стр.Контрагент.Партнер;
		нс.ОбъектРасчетов = НайтиОбъектРасчетов(Стр.Договор);
		нс.Сумма = Стр.Сумма;
		
		нс = ДокОбъект.ДоходыРасходыАктивыПассивы.Добавить();
		нс.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		нс.Статья = СтатьяРасходов;
		нс.Подразделение = Подразделение;
		
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул", "гф_КорректировкаЗадолженностиВидКорректировкиДолга");
			НаборЗаписей = Регистрысведений.ДополнительныеСведения.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(ДокОбъект.Ссылка);
			НаборЗаписей.Отбор.Свойство.Установить(Свойство);
			Запись = НаборЗаписей.Добавить();
			Запись.Объект = ДокОбъект.Ссылка;
			Запись.Свойство = Свойство;
			Запись.Значение = Стр.ВидБонуса;
			НаборЗаписей.Записать();
			
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Стр.КорректирокаЗадолженности = ДокОбъект.Ссылка;
			
		Исключение
			Сообщить("Ошибка:" + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКорректировкиЗадолженностей(Команда)
	Если Не ЗначениеЗаполнено(СтатьяРасходов) Тогда
		Сообщить("Надо указать Статью расходов!");
		Возврат;
	КонецЕсли;
	СоздатьКорректировкиЗадолженностейНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиОбъектРасчетов(Договор)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбъектыРасчетов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	               |ГДЕ
	               |	ОбъектыРасчетов.Договор = &Договор";
				   //|	И НЕ ОбъектыРасчетов.ПометкаУдаления";
	Запрос.УстановитьПараметр("Договор", Договор);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
